Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaElementType Property
 Gets or sets the area element type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartAreaAttributes.AreaElementTypeEnum AreaElementType { get; set; }
Public Property AreaElementType As AnalysisPartAreaAttributes.AreaElementTypeEnum
	Get
	Set
Property Value
Type: AnalysisPartAreaAttributes.AreaElementTypeEnum
See Also
Reference
AnalysisPartAreaAttributes Class
Tekla.Structures.Analysis Namespace